app/controllers/authentications_controller.rb

SELECT "authentications".* FROM "authentications" WHERE "authentications"."provider" = 'developer' AND "authentications"."uid" IS NULL LIMIT 1
INSERT INTO "authentications" ("created_at", "provider", "uid", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Sat, 20 Oct 2012 22:56:26 CEST +02:00], ["provider", "developer"], ["uid", "mol@easycoaching.dk"], ["updated_at", Sat, 20 Oct 2012 22:56:26 CEST +02:00], ["user_id", 3]]
UPDATE "users" SET "login_count" = 8, "last_login_at" = '2012-10-20 20:56:09.910340', "current_login_at" = '2012-10-20 20:58:43.732665', "last_request_at" = '2012-10-20 20:58:43.765658', "updated_at" = '2012-10-20 20:58:43.767370' WHERE "users"."id" = 3
---
  def create
    omniauth = request.env['omniauth.auth']
    authentication = Authentication.find_by_provider_and_uid(omniauth['provider'], omniauth['uid'])

    if authentication
      # User is already registered with application
      flash[:info] = I18n.t('login_success')
      sign_in_and_redirect(authentication.user)
    elsif current_user
      # User is signed in but has not already authenticated with this social network
      current_user.authentications.create!(:provider => omniauth['provider'], :uid => omniauth['uid'])
      current_user.apply_omniauth(omniauth)
      current_user.save