app/controllers/users_controller.rb

  def show
    if params[:user_id].present?
      @user = User.find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1

  def create
    @user = User.new(params[:user])

    if @user.save
---
INSERT INTO "users" ("created_at", "crypted_password", "current_login_at", "current_login_ip", "email", "failed_login_count", "last_login_at", "last_login_ip", "last_request_at", "login", "login_count", "name", "password_salt", "perishable_token", "persistence_token", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16) RETURNING "id"