app/controllers/user_sessions_controller.rb

UPDATE "users" SET "login_count" = 2, "failed_login_count" = 0, "last_login_at" = '2012-10-20 15:34:56.968884', "current_login_at" = '2012-10-20 15:54:20.614012', "last_login_ip" = '127.0.0.1', "last_request_at" = '2012-10-20 15:54:20.617307', "perishable_token" = 'yvzEukuK8wnMzC3NX5m', "updated_at" = '2012-10-20 15:54:20.618649' WHERE "users"."id" = 1
---
  def create
    if @user_session.save

SELECT "users".* FROM "users" WHERE (perishable_token = '1' and updated_at > '2012-10-06 19:03:55.548280') LIMIT 1
---
  def load_user_from_perishable_token
    @user = User.find_using_perishable_token(params[:id])